# help

def bot_token ():
    return 'EW4Ym48lRJUqm7v4gGmapwJs7GSztlNCRprRc83izDSBgUTa6AlrZoM9VoIe3loVAFRMkA7HDkSyBWeCNzUkxNAFmPbI5j8tu6drR2k-NX_NpKFfw-bozOd3JB3MeH878acwf8mzEAdkXHIG'

def me_token ():
    return 'lbPaUy7i3eV9N9MQc15gEul_34Nas6ye0wRqIYPT3-U1fRCiFtEwvqK9ouA'

def sql_connect ():
    from mysql.connector import connect
    return connect(user='Erfan' , password='nohack' , database='mybot')

# keyboard

def game_loop_keyboard_init():
    return [ [{'text' : 'دارایی ها' , 'command' : '//daraiy_ha'}] , [{'text' : 'جادو ها'   , 'command' : '//magics'   } , {'text' : 'خروج از بازی' , 'command' : '//exit_game'}] ]

def main_page_keyboard_init():
    return[ [{'text' : 'شروع بازی'       , 'command' : '//start_game_main_page'} , {'text' : 'تغییر نام'              , 'command' : '//change_name_main_page'}] ,
            [{'text' : 'امتیاز های من'   , 'command' : '//amtiaz_ha_main_page' } , {'text' : 'پاک کردن تمام امتیازات' , 'command' : '//delete_data_main_page'}] ,
            [{'text' : 'بهترین های بازی' , 'command' : '//best_gamer_main_page'} , {'text' : 'روش بازی'               , 'command' : '//help_about_game'      }] ]

# messages

def messge_help_about_game_mohtava ():
    return '''محتوات بازی دژ:
    ۸ عدد کارت نقش
    ۶۱ عدد کارت سازه
    سکه ها (نامحدود)
    تاج پادشاه'''

def message_help_about_game_karakters ():
    return '''۱. آدمکش:
    
    نام نقشی را که می خواهی به قتل برسانی، اعلام کن. وقتی آن نقش فراخوانی شد تا نوبتش را انجام بدهد. بعد از رو کردن کارت نقشش. بدون اینکه بتواند کاری انجام بدهد. نوبتش تمام می شود.
    

    ۲. راهزن:

    نام نقشی را که می خواهی از او سرقت کنی، اعلام کن. وقتی آن نقش فراخوانی شد تا نوبتش را انجام بدهد. بلافاصله بعد از رو کردن کارت نقشش. تمام سکه هایش را برای خودت بردار. نکته: راهزن نمی تواند از آدمکش و با بازیکنی که آدمکش او را به قتل رسانده، راهزنی کند.

    ۳. تردست:
    یکی از این دو کار را به انتخاب خودت انجام بده:

    کل کارت های دستت کارت های سازه را با کل کارت های دست یکی از بازیکن ها عوض کن. اگر هیچ کارتی دستت نیست، به سادگی کل کارت های یکی از بازیکن ها را برای خودت بردار .
    هر تعداد کارت که مایل هستی از دست خودت بسوزان. زیر دسته کارت سازه قرار بده و به همان تعداد کارت از روی دسته بردار.

    ۴. شاه:

    به ازای هر کارت سازه سلطنتی که در شهر خود داری، یک سکه از بانک بگیر. به محض فراخوانی، تاج را از بازیکن تاجدار تحویل بگیر. از حالا به بعد تو مسئول ادامه فراخوانی نقش ها هستی. دور بعدی بازی را هم تو آغاز خواهی کرد. اگر آدمکش تو را کشته شده باشد، نوبتت از بین می رود، ولی تاج را دریافت خواهی کرد.

    ۵ حکیم:

    به ازای هر کارت سازه آیینی بازی که در شهر خود داری، یک سکه از بانک بگیر. نقش شماره ی ۸ (سردار) نمی تواند سازه های شهری ات را نابود کند.

    ۶ تاجر:

    به ازای هر کارت سازهای تجاری که در شهر خود داری، یک سکه از بانک بگیر. در مرحله ی نوبت، هر منبعی را که انتخاب کردی، همراهش یک سکه هم از بانک بگیر.

    ٧. معمار:

    در مرحله ی نوبت، هر منبعی را که انتخاب کردی، همراهش دو کارت سازه هم بردار در این نوبت می توانی تا سه کارت سازه را در شهر خود بسازی۔

    ۸. سردار:

    به ازای هر کارت سازه ای نظامی که در شهر خود داری، یک سکه از بانک بگیر. می توانی یک کارت سازه از یک بازیکن دیگر را به انتخاب خودت، نابود کنی. برای این کار باید هزینه ای برابر با یک سکه کمتر از هزینه ی آن کارت را به بانک پرداخت کنی. مثلا یک کارت سازه با هزینه ی ۳ سکه را با پرداخت ۲ سکه، کارت سازه با هزینه ی ۲ سکه را با پرداخت ۱ سکه و کارت سازه با هزینه ی ۱ سکه را می توانی رایگان نابود کنی.
    نمی توانی از شهری که هفت سازه اش کامل شده، کارتی را نابود کنی. اما می توانی یک کارت از شهر خودت را نابود کنی کارت نابودشده را زیر دسته کارت سازه بگذار.
    '''

def message_help_about_game_rules_amtiazs ():
    return '''قوانین شمارش امتیاز:
    امتیاز های شهر شما بر اساس قیمت کارت های ساخته شده است. 
    اگر شهر شما از هر کدام از پنج رنگ سازه حداقل یکی را داشته باشد، ۳ امتیاز اضافه دریافت می کنید.
    بازیکنی که زودتر از بقیه بازیکنان هفت سازه در شهرش ساخته باشد، ۴ امتیاز می گیرد. تمام بازیکنان دیگری هم که تا پایان بازی موفق به ساختن هفتمین سازه شوند، ۲ امتیاز می گیرند.
    کارت های خاص که امتیاز اضافی دارند اگر ساخته شده باشند امتیاز انها نیز محاسبه می گردد.
    بعد از ساخته شدن کارت هشتم یک شهر بازی تمام است و امتیازات توسط ربات محاسبه و برنده اعلام می گردد. در صورت مساوی بودن امتیازات، بازیکنی که عدد نقشش بالاتر از بقیه باشد، برنده بازی است.'''

def message_help_about_game_rules_game ():
    return '''قوانین استفاده از ربات به شرح زیر است:
    هرگونه اسپم به ربات کار غلطی بوده و باعث بن شن حساب کاربر می شود.
    در صورت هرگونه بروز هرگونه مشکل و یا نیاز به راهنمایی می توانید در ربات پشتیبانی مشکل خود را مطرح کنید.
    امکان انتقال سکه های بازی برای تمام بازیکنانی که بیشتر از یک هفته در بازی حساب داشته اند موجود است.
    برای کمک کردن به پروژه ربات می توانید در خواست خود را در ربات پشتیبان مطرح کنید لازم به ذکر است زبان برنامه پایتون است.
    ارسال هرگونه تبلیغات , ادرس سایت , ارسال ایدی و ارسال حروف انگلیسی ممنوع است.
    در صورت پاک کردن اطلاعات حساب خود به هیچ وجه امکان بازگشت وجود ندارد.
    تمام افراد پشتیبان در اخر اسم خود کلمه (پشتیبان) را دارند و در صورت بروز مشکل با ایدی @poshtibani_dej_bot تنها ایدی مورد تایید بازی است.

    از توجه شما سپاس گزاریم'''
